In [88]:
# Practice Question on Group by 
# Resources : https://www.udemy.com/course/python-pandas/learn/lecture/33233708#overview

In [89]:
import pandas as pd

In [90]:
Transaction  = pd.read_csv('D:\\karan data\\Data for Preprocessing\\retail\\transactions.csv')

In [91]:
Transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [92]:
Transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [93]:
Transaction['date'] = pd.to_datetime(Transaction['date'])

In [94]:
Transaction['Month'] = Transaction['date'].dt.month

In [95]:
Transaction.head(3)

        date  store_nbr  transactions  Month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1

In [96]:
Transaction.groupby(['store_nbr', 'Month'])[['transactions']].sum().sort_values(by = ['Month', 'transactions'], ascending=[True, False])

                 transactions
store_nbr Month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

In [97]:
df = Transaction.groupby(['store_nbr', 'Month'])\
.agg(sum = ('transactions', 'sum'), mean = ('transactions', 'mean'))\
.sort_values(by = ['Month', 'sum', 'mean'], ascending = [True, False, False])\
.iloc[:5]\
.reset_index()

In [98]:
df

   store_nbr  Month     sum         mean
0         44      1  628438  4246.202703
1         47      1  568824  3843.405405
2         45      1  538370  3637.635135
3         46      1  522763  3532.182432
4          3      1  463260  3151.428571

In [99]:
Transaction = Transaction.assign(
    target_pct = Transaction['transactions']/2500,
    met_target = (Transaction['transactions']/2500) >= 1,
    bonus_payable = ((Transaction['transactions']/2500) >= 1)*100,
    day_of_weeks = Transaction['date'].dt.day_of_week
    )

In [100]:
Transaction

,date,store_nbr,transactions,Month,target_pct,met_target,bonus_payable,day_of_weeks
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2
...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1
83484,2017-08-15,51,1573,8,0.6292,False,0,1
83485,2017-08-15,52,2255,8,0.9020,False,0,1
83486,2017-08-15,53,932,8,0.3728,False,0,1
83487,2017-08-15,54,802,8,0.3208,False,0,1

In [101]:
Transaction.groupby(['store_nbr'])\
           .agg({'met_target' :'mean', 'bonus_payable': 'sum'})\
           .sort_values(by = 'bonus_payable', ascending=False)\
           .iloc[:5]

           met_target  bonus_payable
store_nbr
47           0.999404         167600
44           0.998807         167500
45           0.997615         167300
3            0.998210         167300
46           0.989267         165900

In [102]:
Transaction.groupby(['Month'])\
           .agg({'met_target' :'mean', 'bonus_payable': 'sum'})\
           .sort_values(by = 'bonus_payable', ascending=False)\
           .iloc[:5]

       met_target  bonus_payable
Month
12       0.255640         154100
5        0.170792         131800
3        0.169461         130400
4        0.174469         129700
7        0.162486         126300

In [103]:
Transaction.groupby(['day_of_weeks'])\
           .agg({'met_target' :'mean', 'bonus_payable': 'sum'})\
           .sort_values(by = 'bonus_payable', ascending=False)\
           .iloc[:5]

              met_target  bonus_payable
day_of_weeks
5               0.222204         266400
6               0.204001         241700
4               0.179007         213000
0               0.160214         191600
2               0.160572         191000

In [104]:
Transaction

,date,store_nbr,transactions,Month,target_pct,met_target,bonus_payable,day_of_weeks
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2
...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1
83484,2017-08-15,51,1573,8,0.6292,False,0,1
83485,2017-08-15,52,2255,8,0.9020,False,0,1
83486,2017-08-15,53,932,8,0.3728,False,0,1
83487,2017-08-15,54,802,8,0.3208,False,0,1

In [119]:
Transaction.groupby(['store_nbr', 'day_of_weeks'])['transactions'].transform('mean')

0         740.245690
1        1870.782427
2        1952.652720
3        3142.682008
4        1499.569038
            ...
83483    2342.410788
83484    1548.448133
83485    1892.588235
83486     877.214286
83487     817.721992
Name: transactions, Length: 83488, dtype: float64

In [110]:
Transaction = Transaction.assign(
                                Average_Transaction = Transaction.groupby(['store_nbr', 'day_of_weeks'])['transactions'].transform('mean').round(2),
                                difference = lambda x : x['transactions'] - x['Average_Transaction'] 
                                )

In [106]:
# Transaction = Transaction.assign(difference = lambda x : x['transactions'] - x['Average_Transaction'])

In [111]:
Transaction

,date,store_nbr,transactions,Month,target_pct,met_target,bonus_payable,day_of_weeks,Average_Transaction,difference
0,2013-01-01,25,770,1,0.3080,False,0,1,740.25,29.75
1,2013-01-02,1,2111,1,0.8444,False,0,2,1870.78,240.22
2,2013-01-02,2,2358,1,0.9432,False,0,2,1952.65,405.35
3,2013-01-02,3,3487,1,1.3948,True,100,2,3142.68,344.32
4,2013-01-02,4,1922,1,0.7688,False,0,2,1499.57,422.43
...,...,...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1,2342.41,461.59
83484,2017-08-15,51,1573,8,0.6292,False,0,1,1548.45,24.55
83485,2017-08-15,52,2255,8,0.9020,False,0,1,1892.59,362.41
83486,2017-08-15,53,932,8,0.3728,False,0,1,877.21,54.79
83487,2017-08-15,54,802,8,0.3208,False,0,1,817.72,-15.72

In [124]:
Transaction.query('store_nbr== 26').groupby('day_of_weeks').agg({'transactions' : 'mean'})

              transactions
day_of_weeks
0               600.232365
1               580.535270
2               616.535565
3               563.058577
4               638.916318
5               731.668050
6               712.344538